# features of pandas-
1) Import dataset, Example- .csv Excel
2)  Data cleaning-  missing values and invalid values
3)  size mutability(Add or delete columns and rows)
4)  Reshaping and piovting (piovit table)
5)  Efficient, manupulation,extraction
6)  Stastical analysis

- Series--
    It is a collection which looks like 1d array

In [3]:
# import essential libraries
import numpy as np
import pandas as pd

In [4]:
df = pd.Series([22,33,55,77],name='Age')
df

0    22
1    33
2    55
3    77
Name: Age, dtype: int64

- Differnce between array and series-

  1) Array-
     1) Array belongs to numpy
     2) string/objects
     3) It display only data
  - Syntax -
        - np.array(coll)
    
  2) Series-
    1) Series belongs to pandas
    2) complex/objects
    3) It display data,index,datatype
  - syntax-
        - pd.series(coll)

    - var = pd.Series([val1,val2,...,valn],name='col_name')
    -

In [12]:
s = pd.Series([22,33,55,77],name='Age')
df=s.to_frame()
df

   Age
0   22
1   33
2   55
3   77

- syntax --    df.values
 
- It will written the values

single iloc-
 - It will return the values present at particular index
-syntax-
   - var.iloc[index,index,---index]
  
- NOte

In [5]:
a = np.arange(1,15)
a

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

In [14]:
import pandas as pd
s= pd.Series(a)
s

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
dtype: int64

In [15]:
print(s.iloc[3])

4

In [16]:
print(s.iloc[1:12])

1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
dtype: int64

- loc  - It is use to fetch multiple values present of index.

In [10]:
df.loc[2]

np.int64(55)

In [11]:
d = {'apple':110,'banana':40,'mango':20,'grapes':100,'kivi':12}
d = pd.Series(d,name='Prices')

df=d.to_frame()
df

        Prices
apple      110
banana      40
mango       20
grapes     100
kivi        12

In [12]:
print(d.iloc[3])

100

In [13]:
d[d>100]

apple    110
Name: Prices, dtype: int64

In [14]:
d[(d>30)&(d<50)]

banana    40
Name: Prices, dtype: int64

In [22]:
d[d!=20]

apple     110
banana     40
grapes    100
kivi       12
Name: Prices, dtype: int64

In [23]:
d[~(d>20)]

mango    20
kivi     12
Name: Prices, dtype: int64

#  Data frame-
It is a collection of 2d array collection of series , collection of row and columnns
-Syntax-
       - var = pd. Dataframe(dict)

In [24]:
b = {'Sname':['Aman','Suraj','anuj','arpit','suyash'],
     'Sid':[101,102,103,104,105],
      'Sal':[1232,4577,3144,5354,4566]}
df = pd.DataFrame(b)
df

    Sname  Sid   Sal
0    Aman  101  1232
1   Suraj  102  4577
2    anuj  103  3144
3   arpit  104  5354
4  suyash  105  4566

In [25]:
df[1:3]

   Sname  Sid   Sal
1  Suraj  102  4577
2   anuj  103  3144

In [26]:
df.iloc[1,1]

np.int64(102)

In [27]:
df[['Sal','Sid']]

    Sal  Sid
0  1232  101
1  4577  102
2  3144  103
3  5354  104
4  4566  105

# Note-
- We can apply slicing on dataframe but we can not apply indexing on dataframe
- we can fetch columns or multiple column at a time.
- syntax
- var['col_name]
- var[['col_name','col_name"----]
- we can applay indexing on particular single column of dataframe
- Syntax
- var['col_name'][index]
-

In [28]:
df['Sal']

0    1232
1    4577
2    3144
3    5354
4    4566
Name: Sal, dtype: int64

In [29]:
df['Sal'][3]

np.int64(5354)

In [30]:
df['Sal'][3]=8787
df

C:\Users\hp\AppData\Local\Temp\ipykernel_18716\3840483877.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Sal'][3]=8787

    Sname  Sid   Sal
0    Aman  101  1232
1   Suraj  102  4577
2    anuj  103  3144
3   arpit  104  8787
4  suyash  105  4566

In [31]:
df['City']='Lucknow','Noida','Panjab','jaunpur','Delhi'
df

    Sname  Sid   Sal     City
0    Aman  101  1232  Lucknow
1   Suraj  102  4577    Noida
2    anuj  103  3144   Panjab
3   arpit  104  8787  jaunpur
4  suyash  105  4566    Delhi

In [32]:
df['Bonus']=[1111,1112,1113,1114,1115]
df

    Sname  Sid   Sal     City  Bonus
0    Aman  101  1232  Lucknow   1111
1   Suraj  102  4577    Noida   1112
2    anuj  103  3144   Panjab   1113
3   arpit  104  8787  jaunpur   1114
4  suyash  105  4566    Delhi   1115

In [17]:
df1 = pd.read_csv("https://raw.githubusercontent.com/Taj1920/Data-Analysis-Datasets/refs/heads/main/Datasets-Practice/hr_data.csv")

In [18]:
df1

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...
14994,87670,2,151,3,0,1,0,support,low
14995,87673,2,160,3,0,1,0,support,low
14996,87679,2,143,3,0,1,0,support,low
14997,87681,6,280,4,0,1,0,support,low
14998,87684,2,158,3,0,1,0,support,low

# info()-
- It will  the complete info of the dataframe
- syntax
-        var.info()
-    
- df1.columns  It will return the all the columns name
 - df1.sample()                 It will fetch the random row from the database
 - - df1.sort_values("left")  It sort the dataframe based on particular column
   - - It will sorting the datafrmae  in accending manner

In [20]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   employee_id            14999 non-null  int64
 1   number_project         14999 non-null  int64
 2   average_montly_hours   14999 non-null  int64
 3   time_spend_company     14999 non-null  int64
 4   Work_accident          14999 non-null  int64
 5   left                   14999 non-null  int64
 6   promotion_last_5years  14999 non-null  int64
 7   department             14999 non-null  object
 8   salary                 14999 non-null  object
dtypes: int64(7), object(2)
memory usage: 1.0+ MB

In [24]:
df1["salary"].value_counts()

salary
low       7316
medium    6446
high      1237
Name: count, dtype: int64

In [23]:
df1.columns

Index(['employee_id', 'number_project', 'average_montly_hours',
       'time_spend_company', 'Work_accident', 'left', 'promotion_last_5years',
       'department', 'salary'],
      dtype='object')

In [25]:
df1.sample()

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
14432,42157,2,135,3,0,1,0,product_mng,low

In [26]:
df1.sample(5)

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
13395,78276,4,135,3,0,0,1,RandD,medium
2436,14719,4,199,2,0,0,0,RandD,low
11621,68057,5,240,7,0,0,0,sales,medium
13690,79998,5,268,3,0,0,0,RandD,medium
1177,75075,4,249,5,0,1,0,hr,low

In [27]:
df1

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...
14994,87670,2,151,3,0,1,0,support,low
14995,87673,2,160,3,0,1,0,support,low
14996,87679,2,143,3,0,1,0,support,low
14997,87681,6,280,4,0,1,0,support,low
14998,87684,2,158,3,0,1,0,support,low

In [33]:
df1.sort_values("left")

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
3748,22395,5,127,3,0,0,0,sales,low
11428,89239,4,215,2,0,0,0,sales,low
11429,66920,4,157,3,0,0,0,accounting,low
11430,66927,3,149,3,0,0,0,support,low
11431,66951,3,221,2,0,0,0,technical,low
...,...,...,...,...,...,...,...,...,...
14994,87670,2,151,3,0,1,0,support,low
14995,87673,2,160,3,0,1,0,support,low
14996,87679,2,143,3,0,1,0,support,low
14997,87681,6,280,4,0,1,0,support,low
14998,87684,2,158,3,0,1,0,support,low

In [37]:
df1.loc[22:50]

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
22,1158,6,304,4,0,1,0,sales,low
23,1166,2,139,3,0,1,0,sales,low
24,1175,2,158,3,0,1,0,sales,low
25,1184,5,242,5,0,1,0,sales,low
26,1186,4,239,5,0,1,0,sales,low
27,1201,2,135,3,0,1,0,sales,low
28,1203,2,128,3,0,1,0,accounting,low
29,1204,2,132,3,0,1,0,accounting,low
30,1214,6,294,4,0,1,0,accounting,low
31,1223,2,134,3,0,1,0,hr,low
32,1228,2,145,3,0,1,0,hr,low
33,1230,2,140,3,0,1,0,hr,low
34,1236,4,246,6,0,1,0,hr,low
35,4266,6,255,4,0,1,0,technical,low
36,1240,2,137,3,0,1,0,technical,low
37,1248,2,126,3,0,1,0,technical,low
38,1256,6,306,4,0,1,0,technical,low
39,4414,2,152,3,0,1,0,technical,low
40,1284,5,269,5,0,1,0,technical,low
41,5983,2,158,3,0,1,0,technical,low
42,1293,2,127,3,0,1,0,technical,low
43,7010,7,281,4,0,1,0,technical,low
44,52647,6,276,4,0,1,0,technical,low
45,10497,3,182,4,0,1,0,technical,low
46,1310,2,147,3,0,1,0,support,low
47,1311,3,273,6,0,1,0,support,low
48,1316,2,148,3,0,1,0,support,low
49,1319,2,147,3,0,1,0,support,low
50,10865,6,152,2,0,1,0,support,low

In [39]:
df1.loc[2452]

# It will return the all the data of the column for ARTICULAR INDEX

employee_id              14834
number_project               2
average_montly_hours       194
time_spend_company           2
Work_accident                0
left                         0
promotion_last_5years        0
department               sales
salary                     low
Name: 2452, dtype: object

In [42]:
df1.loc[55:60]

# It will slice the Data frame based on index

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
55,1347,2,140,3,0,1,0,support,low
56,14030,7,255,4,0,1,0,support,low
57,1361,6,309,4,0,1,0,technical,low
58,1371,2,128,3,0,1,0,technical,low
59,1374,4,225,5,0,1,0,technical,low
60,1393,5,226,5,0,1,0,management,medium

In [44]:
df1.loc[25:44:2,["left","salary"]]
# It will give the data of particular column as mentioned index.

    left salary
25     1    low
27     1    low
29     1    low
31     1    low
33     1    low
35     1    low
37     1    low
39     1    low
41     1    low
43     1    low

In [45]:
df.iloc[2:44,2:5]
# It is used to slicing though multiple column

    average_montly_hours  time_spend_company  Work_accident
2                    272                   4              0
3                    223                   5              0
4                    159                   3              0
5                    153                   3              0
6                    247                   4              0
7                    259                   5              0
8                    224                   5              0
9                    142                   3              0
10                   135                   3              0
11                   305                   4              0
12                   234                   5              0
13                   148                   3              0
14                   137                   3              0
15                   143                   3              0
16                   160                   3              0
17                   255                   6              0
18                   160                   3              1
19                   262                   5              0
20                   282                   4              0
21                   147                   3              0
22                   304                   4              0
23                   139                   3              0
24                   158                   3              0
25                   242                   5              0
26                   239                   5              0
27                   135                   3              0
28                   128                   3              0
29                   132                   3              0
30                   294                   4              0
31                   134                   3              0
32                   145                   3              0
33                   140                   3              0
34                   246                   6              0
35                   255                   4              0
36                   137                   3              0
37                   126                   3              0
38                   306                   4              0
39                   152                   3              0
40                   269                   5              0
41                   158                   3              0
42                   127                   3              0
43                   281                   4              0